# s = "我爱周杰伦他媳妇"

# print(s[0])
# print(s[1])
# print(s[2])
# print(s[3])
# print(s[4])

# print(s[-1])
# print(s[-2])
# print(s[-3])
# print(s[-4])

# 通过索引获取到的内容. 还是一个字符串
# 切片可以对字符串进行截取
# 语法 s[起始位置: 结束位置]
#  特点:顾头不顾腚

# s = "alex和wusir经常在一起搞基"
# s1 = s[5:10]
# print(s1)
# s2 = s[0:4] + s[5:10]
# print(s2)
# s3 = s[5:]  # 默认到结尾
# print(s3)
#
# s4 = s[:10] # 从头开始
# print(s4)
# s5 = s[:]   # 从头到尾都切出来
# print(s5)

# s6 = s[-2:] # 从-2 切到结尾  默认从左往右切
# print(s6)

# 步长
# 语法:ｓ[起始位置: 结束位置: 步长]
# s = "我是梅西,我很慌"
# s1 = s[1:5:2]   # 从1开始, 到5结束, 每2个取1个
# print(s1)

# s2 = s[::3]
# print(s2)
# s3 = s[6:2:-1]   # - 表示反着来. 每两个取1个
# print(s3)


# s = "这个标点符号很蛋疼"
# # s1 = s[7::-2]
# # print(s1)
#
# s2 = s[-1:-6:-2]
# print(s2)

